module.exports = {
  /* 邮箱 */
  email: /^([a-z0-9_\.-]+)@([\da-z\.-]+)\.([a-z\.]{2,6})$/,
  /* 网址 */
  webUrl: /^(https?:\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/,
  /* 手机号码 */
  phone: /^(13[0-9]|14[5|7]|15[0|1|2|3|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\d{8}$/,
  /* 电话号码 */
  telephone: /^(\(\d{3,4}-)|\d{3.4}-)?\d{7,8}$/,
  /* 账号 (字母开头，允许 5~16字节，允许字母数字下划线) */
  user: /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/,
  /* 密码 (字母开头，长度在 6~18 之间，只能包含字母、数字和下划线) */
  pass: /^[a-zA-Z]\w{5,17}$/,
  /* 中国邮政编码 */
  zipCode: /[1-9]\d{5}(?!\d)/,
  /* 腾讯QQ号 */
  qq: /[1-9][0-9]{4,9}/,
  /* 中文 */
  zh: /[\u4e00-\u9fa5]/
}
